ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/TIMG14_1.0.xml
        <register id="TIMG14_PL" width="32" offset="0xA0" description="Phase Load Register">
            <bitfield id="PHASE" description="Phase Load value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_DBCTL" width="32" offset="0xA4" description="Dead Band insertion control register">
            <bitfield id="RISEDELAY" description="Rise Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal." begin="11" end="0" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="FALLDELAY" description="Fall Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal." begin="27" end="16" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="M1_ENABLE" description="Dead Band Mode 1 Enable." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
        </register>
        <register id="TIMG14_TSEL" width="32" offset="0xB0" description="Trigger Select Register">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules. Refer to the SoC datasheet for details related to timer trigger sources.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
        <register id="TIMG14_RC" width="32" offset="0xB4" description="Repeat counter Register">
            <bitfield id="RC" description="Repeat Counter Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_RCLD" width="32" offset="0xB8" description="Repeat counter load Register">
            <bitfield id="RCLD" description="Repeat Counter Load Value
This field provides the value loaded into the
repeat counter at a load event following the
repeat counter value equaling 0." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_FCTL" width="32" offset="0xD0" description="Fault Control Register">
            <bitfield id="FIEN" description="Fault Input Enable
This bit enables the input for fault detection." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Fault Input Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Fault Input Enabled"/>
            </bitfield>
            <bitfield id="FI" description="Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="INDEPENDENT" value="0x0" description="Overall Fault condition is not dependent on sensed input."/>
                <bitenum id="DEPENDENT" value="0x1" description="Overall Fault condition is dependent on sensed input."/>
            </bitfield>
            <bitfield id="TFIM" description="Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Selected trigger does not participate in fault condition generation"/>
                <bitenum id="ENABLED" value="0x1" description="Selected trigger participates in fault condition generation"/>
            </bitfield>
            <bitfield id="FL" description="Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="NO_LATCH" value="0x0" description="Overall fault condition is not dependent on the F bit in RIS"/>
                <bitenum id="LATCH_SW_CLR" value="0x1" description="Overall fault condition is dependent on the F bit in RIS"/>
                <bitenum id="LATCH_Z_CLR" value="0x2" description="Fault condition is latched. Fault condition is cleared on a zero event if the fault input is 0."/>
                <bitenum id="LATCH_LD_CLR" value="0x3" description="Fault condition is latched. Fault condition is cleared on a load event if the fault input is 0."/>
            </bitfield>
            <bitfield id="FSENAC0" description="Specifies whether the COMP0 output high/low is treated as fault condition." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC1" description="Specifies whether the COMP1 output high/low is treated as fault condition." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC2" description="Specifies whether the COMP2 output high/low is treated as fault condition." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT0" description="Specifies whether the external fault pin0 high/low is treated as fault condition." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT1" description="Specifies whether the external fault pin1 high/low is treated as fault condition." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT2" description="Specifies whether the external fault pin2 high/low is treated as fault condition." begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
        </register>
