ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/TIMG14_1.0.xml
        <register id="TIMG14_FIFCTL" width="32" offset="0xD4" description="Fault input Filter control register">
            <bitfield id="FP" description="Filter Period
This field specifies the sample period for the input filter.  I.e. The input is sampled for FP timer clocks during filtering." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="PER_3" value="0x0" description="Filter Period 3"/>
                <bitenum id="PER_5" value="0x1" description="Filter Period 5"/>
                <bitenum id="PER_8" value="0x2" description="Filter Period 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select
This bit controls whether the input filter uses a stricter consecutive period count or majority voting." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CONSEC_PER" value="0x0" description="Consecutive Periods. The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="VOTING" value="0x1" description="Voting. The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output"/>
            </bitfield>
            <bitfield id="FILTEN" description="Filter Enable
This bit controls whether the input is filtered by the input filter or bypasses to go directly to the optional pre-scale filter and then to the edge detect." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="BYPASS" value="0x0" description="Bypass"/>
                <bitenum id="FILTERED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        </group>

</module>